####################
#مربوط به محاسبات کلی#
####################

#درصد محاسبه کارمزد که احتمالا ۱.۴۶ درصد صحیح تر است
settings.wageRate = 1.5
#پس از بدست آوردن بهترین معاملات، آنهایی که بیشتر از این مقدار معامله دارند، صرف نظر شود
#قاعدتا کاربر علاقه دارد، تا با یک تعداد معامله محدود، بهترین گین را بدست بیاورد
settings.maxTradeNo = 10

#######################
#مربوط به میانگین متحرک ها#
#######################

#از تاریخ تا تاریخ (برای محاسبه میانگین متحرک ها در یک بازه تاریخی)
settings.sma.smaFromTo = c('2017-03-21', '2019-03-21')
#بردار میانگین متحرک کوتاه مدت
settings.sma.smaMinMaxLow = 1:90
#بردار میانگین متحرک بلند مدت
settings.sma.smaMinMaxHigh = 1:90

################
#مربوط به شرکت ها#
################

#شرکت های که بیش از n روز از آخرین معامله آنها گذشته است
settings.company.daysPastFromLastTrade = 7